export const metadata = {
	title: {
		default: "Политика конфиденциальности",
	},
	description: 'Политика конфиденциальности на сайте фонда "Ангел"',
};

const info = [
	{
		title: "Введение",
		desc1:
			"Настоящая Политика конфиденциальности (далее – «Политика») регулирует порядок обработки, хранения, использования и защиты персональных данных пользователей (далее – «Пользователи») нашего веб-сайта (далее – «Сайт»). Персональные данные включают в себя любые сведения, которые позволяют установить личность Пользователя, включая, но не ограничиваясь, имя, адрес, адрес электронной почты, номер телефона и прочие данные, которые Пользователь добровольно предоставляет на Сайте.",
		desc2:
			"Пользователи, используя Сайт, соглашаются с настоящей Политикой и предоставляют своё согласие на сбор, хранение, обработку и использование их персональных данных в соответствии с условиями данной Политики. Повторяем, использование Сайта означает согласие Пользователя с Политикой.",
	},
	{
		title: "Сбор персональных данных",
		desc1:
			"Сайт может собирать персональные данные Пользователей следующими способами: (1) через формы на Сайте, включая формы регистрации, обратной связи, заявки на услуги; (2) автоматически через использование Сайта, включая файлы cookie, лог-файлы и другие технологии отслеживания; (3) из других источников, которые могут быть предоставлены третьими лицами.",
		desc2:
			"Пользователь, предоставляя свои персональные данные, соглашается с тем, что эти данные будут собираться, обрабатываться и храниться в соответствии с данной Политикой. Важно отметить, что предоставление персональных данных является добровольным, однако в случае отказа от предоставления таких данных некоторые функции Сайта могут быть недоступны.",
	},
	{
		title: "Использование персональных данных",
		desc1:
			"Персональные данные Пользователей могут использоваться в следующих целях: (1) предоставление доступа к функционалу Сайта; (2) обработка заявок и предоставление услуг; (3) поддержка и улучшение работы Сайта; (4) информирование Пользователей о новостях, обновлениях, специальных предложениях и рекламных акциях; (5) анализ пользовательской активности для улучшения взаимодействия с Сайтом.",
		desc2:
			"Обратите внимание, что персональные данные могут использоваться исключительно в соответствии с настоящей Политикой. Данные могут быть использованы только для тех целей, для которых они были собраны. Мы подчеркиваем, что использование данных ограничено указанными целями.",
	},
	{
		title: "Раскрытие персональных данных третьим лицам",
		desc1:
			"Мы обязуемся не продавать, не сдавать в аренду, не обменивать и не передавать персональные данные Пользователей третьим лицам без их согласия. Однако, данные могут быть раскрыты в следующих случаях: (1) по запросу государственных органов в соответствии с законодательством; (2) для защиты прав и интересов Сайта; (3) в случае продажи или реорганизации бизнеса, когда данные могут быть переданы новому владельцу.",
		desc2:
			"Также важно отметить, что мы можем раскрывать данные третьим лицам для предоставления услуг, выполнения обязательств перед Пользователями и улучшения работы Сайта. Это может включать передачу данных провайдерам хостинга, аналитическим сервисам и рекламным партнёрам.",
	},
	{
		title: "Согласие на обработку данных",
		desc1:
			"Используя Сайт, Пользователь выражает своё согласие на сбор, обработку и хранение своих персональных данных в соответствии с условиями данной Политики. Это согласие является добровольным, и Пользователь имеет право отозвать его в любое время, отправив соответствующий запрос на контактные данные, указанные на Сайте.",
		desc2:
			"Повторно обращаем внимание, что Пользователь, используя Сайт, выражает своё согласие на обработку данных в соответствии с данной Политикой. Это согласие может быть отозвано, но некоторые функции Сайта могут стать недоступны после отзыва согласия.",
	},
	{
		title: "Хранение персональных данных",
		desc1:
			"Персональные данные Пользователей будут храниться столько, сколько это необходимо для выполнения целей, указанных в данной Политике, если только более длительный срок хранения не требуется или не разрешён законом. Срок хранения данных может варьироваться в зависимости от типа данных и целей их обработки.",
		desc2:
			"Сайт принимает меры для защиты персональных данных Пользователей от несанкционированного доступа, изменения, раскрытия или уничтожения. Однако, Пользователи должны помнить, что передача данных через Интернет не может быть гарантирована как полностью безопасная. Мы не можем гарантировать абсолютную защиту данных, но предпринимаем все разумные меры для обеспечения их безопасности.",
	},
	{
		title: "Защита персональных данных",
		desc1:
			"Сайт применяет различные меры безопасности для защиты персональных данных Пользователей, включая физические, электронные и управленческие меры. Это включает использование шифрования данных, брандмауэров, контролируемого доступа к данным и других технологий, направленных на защиту данных.",
		desc2:
			"Однако, несмотря на все усилия, невозможно гарантировать абсолютную защиту данных в Интернете. Пользователь признаёт и соглашается с тем, что передача данных через Интернет может подвергаться рискам, и Сайт не несёт ответственности за утечки данных, которые могут произойти в результате несанкционированного доступа к Сайту.",
	},
	{
		title: "Изменения в Политике конфиденциальности",
		desc1:
			"Мы оставляем за собой право вносить изменения в настоящую Политику в любое время и по собственному усмотрению. Все изменения вступают в силу с момента их публикации на Сайте. Пользователям рекомендуется регулярно проверять данную страницу на предмет изменений, чтобы быть в курсе актуальной версии Политики.",
		desc2:
			"Повторяем, что изменения в Политике могут быть внесены в любое время без предварительного уведомления Пользователей. Продолжение использования Сайта после внесения изменений будет рассматриваться как согласие Пользователя с обновлённой Политикой.",
	},
	{
		title: "Примечание",
		desc1:
			"Если Пользователь является гражданином российской федерации, то на него, как на соучастника преступного режима Путина (далее – «Хуйло»), накладываются санкции. Информация пользователя может быть использована создателем сайта для получения неправомерной выгоды (учитывая потерянные активы, следует рассматривать данный акт как компенсацию финансового и морального ущерба).",
	},
	{
		title: "Контактная информация",
		desc1:
			"Если у Пользователя возникают вопросы или предложения относительно данной Политики конфиденциальности, они могут связаться с нами через контактные данные, указанные на Сайте. Мы постараемся ответить на все запросы в разумные сроки и предоставить необходимую помощь.",
		desc2:
			"Контактные данные для связи с администрацией Сайта указаны на странице «Контакты». Пользователи могут направлять свои запросы и предложения по электронной почте или через форму обратной связи на Сайте.",
	},
	{
		title: "Заключительные положения",
		desc1:
			"Настоящая Политика является обязательной для всех Пользователей Сайта. Пользователи обязаны соблюдать её условия и положения, а также предоставлять только достоверные и актуальные персональные данные. Использование Сайта означает полное и безоговорочное согласие Пользователя с настоящей Политикой.",
		desc2:
			"Повторяем, что использование Сайта без согласия с данной Политикой недопустимо. В случае несогласия с условиями Политики, Пользователь обязан незамедлительно прекратить использование Сайта.",
	},
];

const page = () => {
	return (
		<main className="py-4 px-16 text-white/40 select-none">
			<h1 className="h1 text-center">Политика конфиденциальности</h1>
			<div className="mx-auto text-xl font-bold">
				{info.map((item, i) => (
					<div key={i}>
						<h4>{item.title}</h4>
						<span>{item.desc1}</span>
						<span>{item.desc2}</span>
					</div>
				))}
			</div>
		</main>
	);
};

export default page;
